cdhooper/amigapci_stm32/fw/cubemx/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
  p = (uint8_t *) buf;

  if (f->lock == 0U)
  {
    f->lock = 1U;

    for (i = 0U; i < nbytes; i++)
    {
      if (f->tail != f->head)
      {
        *p++ = f->buf[f->tail];
        f->tail++;

        if (f->tail == f->size)
        {
          f->tail = 0U;
        }
      }
      else
      {
        f->lock = 0U;
        return i;
      }
    }
  }

  f->lock = 0U;

  return nbytes;
}

/**
  * @brief  USBH_HID_FifoWrite
  *         Write To FIFO.
  * @param  f: Fifo address
  * @param  buf: read buffer
  * @param  nbytes: number of item to write
  * @retval number of written items
  */
uint16_t USBH_HID_FifoWrite(FIFO_TypeDef *f, void *buf, uint16_t  nbytes)
{
  uint16_t i;
  uint8_t *p;

  p = (uint8_t *) buf;

  if (f->lock == 0U)
  {
    f->lock = 1U;

    for (i = 0U; i < nbytes; i++)
    {
      if ((f->head + 1U == f->tail) ||
          ((f->head + 1U == f->size) && (f->tail == 0U)))
      {
        f->lock = 0U;
        return i;
      }
      else
      {
        f->buf[f->head] = *p++;
        f->head++;

        if (f->head == f->size)
        {
          f->head = 0U;
        }
      }
    }
  }

  f->lock = 0U;

  return nbytes;
}

/**
* @brief  The function is a callback about HID Data events
*  @param  phost: Selected device
* @retval None
*/
__weak void USBH_HID_EventCallback(USBH_HandleTypeDef *phost, HID_HandleTypeDef *HID_Handle)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(phost);
  UNUSED(HID_Handle);
}
/**
* @}
*/

/**
* @}
*/

/**
* @}
*/


/**
* @}
*/


/**
* @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

#include "config.h"
#include "usbh_hid_mouse.h"

static int
readbits(void *ptr, uint startbit, uint bits, uint is_signed)
{
    uint byte = startbit / 8;
    uint bitoff = startbit % 8;
    uint mask = BIT(bits) - 1;
    uint val = ((*(uint *) ((uintptr_t) ptr + byte)) >> bitoff) & mask;

    if (is_signed &&
        (val & BIT(bits - 1))) {
        val |= (0 - BIT(bits));  // Sign-extend negative
    }

    return (val);
}

/*
 * readbits_joy() converts joystick values from the retronicdesign.com
 *                Atari C64 Amiga Joystick v3.2       ID e501.0810
 */
static int
readbits_joy(void *ptr, uint startbit, uint bits, int offset)
{
    int val = readbits(ptr, startbit, bits, 0) + offset;
    int range = abs(offset) / 4;
    if (val < 0 - range)
        val = -1;
    else if (val > 0 + range)
        val = 1;
    else
        val = 0;
#if 0
    switch (val) {
        case 0:             // 0x00
            val = -1;
            break;
        default:
        case  127:          // 0x7f
        case -128:          // 0x80
            val = 0;
            break;
        case -1:            // 0xff
            val = 1;
            break;
    }
#endif
    return (val);
}

static uint8_t
readbits_jpad(void *ptr, uint16_t *startbits)
{
    uint pos;
    uint jpad = 0;
    for (pos = 0; pos < 4; pos++)
        jpad |= ((!!readbits(ptr, startbits[pos], 1, 0)) << pos);
    return (jpad);
}


static uint32_t
readbits_buttons(void *ptr, HID_RDescTypeDef *rd)
{
    uint button;
    uint32_t buttons = 0;
    uint num_buttons = rd->num_buttons;

    if (num_buttons > ARRAY_SIZE(rd->pos_button))
        num_buttons = ARRAY_SIZE(rd->pos_button);

    for (button = 0; button < num_buttons; button++) {
        if ((button < ARRAY_SIZE(rd->pos_button)) &&
            readbits(ptr, rd->pos_button[button], 1, 0)) {
            buttons |= BIT(button);
        }
    }
    return (buttons);
}

/**
  * @brief  USBH_HID_DecodeReport
  *         The function gets and decodes mouse and generic data.
  * @param  phost: Host handle
  * @retval USBH Status
  */
USBH_StatusTypeDef
USBH_HID_DecodeReport(USBH_HandleTypeDef *phost, HID_HandleTypeDef *HID_Handle, HID_TypeTypeDef devtype, HID_MISC_Info_TypeDef *report_info)
{
    HID_RDescTypeDef *rd = &HID_Handle->HID_RDesc;
    uint32_t          report_data[4];
    static uint32_t   report_last[ARRAY_SIZE(report_data)];
    uint16_t          len = sizeof (report_data);
    uint button;
    uint rlen;

    if (HID_Handle == NULL)
        return USBH_FAIL;

    if (HID_Handle->length == 0U)
        return USBH_FAIL;

    if (len > HID_Handle->length)
        len = HID_Handle->length;
    memset(&report_data, 0, sizeof (report_data));
    rlen = USBH_HID_FifoRead(&HID_Handle->fifo, &report_data, len);
    USBH_HID_FifoFlush(&HID_Handle->fifo);  // Discard excess data

    /* Fill report */
    if (rlen > 0) {
        uint cur;
        uint8_t id = report_data[0];
        memset(report_info, 0, sizeof (*report_info));
        report_info->usage = rd->usage;

        if (((rd->id_mouse != 0) && (rd->id_mouse == id)) ||
            ((rd->id_mouse == 0) && (devtype == HID_MOUSE))) {
is_mouse:
            dprintf(DF_USB_DECODE_MOUSE, "\n%08lx %08lx ",
                    report_data[0], report_data[1]);

            report_info->buttons = readbits_buttons(report_data, rd);
            report_info->x = readbits(report_data, rd->pos_x, rd->bits_x, 1);
            report_info->y = readbits(report_data, rd->pos_y, rd->bits_y, 1);
            if (rd->bits_wheel != 0) {
                report_info->wheel = readbits(report_data, rd->pos_wheel,
                                              rd->bits_wheel, 1);
            }
            if (rd->bits_ac_pan != 0) {
                report_info->ac_pan = readbits(report_data, rd->pos_ac_pan,
                                               rd->bits_ac_pan, 1);
            }
        } else if ((rd->id_consumer != 0) && (rd->id_consumer == id)) {
            dprintf(DF_USB_DECODE_MISC, "mmkey");
            for (cur = 0; cur < rd->num_keys; cur++) {
                if (rd->pos_key[cur] == 0)
                    continue;
                report_info->mm_key[cur] =
                        readbits(report_data, rd->pos_key[cur], rd->bits_key, 1);
                dprintf(DF_USB_DECODE_MISC, " %x", report_info->mm_key[cur]);
            }
        } else if ((rd->id_sysctl != 0) && (rd->id_sysctl == id)) {
            report_info->sysctl = readbits(report_data,
                                           rd->pos_sysctl, rd->bits_sysctl, 1);
            dprintf(DF_USB_DECODE_MISC, "Sysctl %x", report_info->sysctl);
        } else if ((rd->id_mouse == 0) && (rd->usage == HID_USAGE_MOUSE)) {
            goto is_mouse;
        } else if ((rd->usage == HID_USAGE_JOYSTICK) ||
                   (rd->usage == HID_USAGE_GAMEPAD)) {
            report_info->buttons = readbits_buttons(report_data, rd);
            report_info->x = readbits_joy(report_data, rd->pos_x,
                                          rd->bits_x, rd->offset_xy);
            report_info->y = readbits_joy(report_data, rd->pos_y,
                                          rd->bits_y, rd->offset_xy);
            if (rd->pos_jpad[0] != 0) {
                report_info->flags |= MI_FLAG_HAS_JPAD;  // Has joypad
                report_info->jpad = readbits_jpad(report_data,
                                                  rd->pos_jpad);
            }
            if (rd->bits_ac_pan != 0) {
                report_info->ac_pan = readbits_joy(report_data,
                                                   rd->pos_ac_pan,
                                                   rd->bits_ac_pan,
                                                   rd->offset_xy);
            }
            if (rd->bits_wheel != 0) {
                report_info->wheel = readbits_joy(report_data,
                                                  rd->pos_wheel,
                                                  rd->bits_wheel,
                                                  rd->offset_xy);
            }
            if (config.debug_flag & DF_USB_DECODE_JOY) {
                if (rd->pos_jpad[0] &&
                    (phost->device.DevDesc.idVendor == 0x057e) &&
                    (phost->device.DevDesc.idProduct == 0x2009)) {
                    /* EasySMX PC USB controller adds timestamp to report */
                    report_data[0] &= ~0x00ff00;  // Clobber timestamp
                }
                if (memcmp(report_data, report_last, 12) != 0) {
                    memcpy(report_last, report_data, sizeof (report_last));
                    printf("\n%08lx %08lx %08lx",
                           report_data[0], report_data[1], report_data[2]);
                    printf(" [%d %d %d %d] ", report_info->x, report_info->y,
                           report_info->ac_pan, report_info->wheel);
                }
            }
        } else {
            if ((config.debug_flag & DF_USB_DECODE_JOY) &&
                (memcmp(report_data, report_last, sizeof (report_data)) != 0)) {
                printf("\n%08lx %08lx %08lx %08lx",
                       report_data[0], report_data[1], report_data[2],
                       report_data[3]);
                memcpy(report_last, report_data, sizeof (report_last));
            }
//          dprintf(DF_USB_DECODE_MISC, "Misc ID %x", id);
        }
        cur = 0;
        for (button = 0; button < rd->num_mmbuttons; button++) {
            uint val;
            if (id != rd->id_mmbutton[button])
                continue;
            val = readbits(report_data, rd->pos_mmbutton[button], 1, 0);
            if (val != 0) {
                if (cur == 0)
                    dprintf(DF_USB_DECODE_MISC, "MMKEY");
                dprintf(DF_USB_DECODE_MISC, " %x", rd->val_mmbutton[button]);
                report_info->mm_key[cur++] = rd->val_mmbutton[button];
                if (cur == ARRAY_SIZE(report_info->mm_key))
                    break;
            }
        }
        return USBH_OK;
    }
    return   USBH_FAIL;
}

static uint32_t hid_rx_report_buf[2][HID_QUEUE_SIZE * 4];

void
USBH_HID_PrepareFifo(USBH_HandleTypeDef *phost, HID_HandleTypeDef *HID_Handle)
{
    uint port = phost->id;

    if (HID_Handle->length_max > sizeof (hid_rx_report_buf[port]))
        HID_Handle->length_max = sizeof (hid_rx_report_buf[port]);

    memset(hid_rx_report_buf[port], 0, sizeof (hid_rx_report_buf[port]));

    HID_Handle->pData = (uint8_t *)(void *) hid_rx_report_buf[port];
    USBH_HID_FifoInit(&HID_Handle->fifo, phost->device.Data,
                      sizeof (hid_rx_report_buf[port]));
}
